In [22]:
import pandas as pd
import numpy as np

In [29]:
pred = pd.read_csv('../result/online_1101.csv')

In [30]:
pred.object_id.nunique()

3492889

In [31]:
set(pred.object_id).symmetric_difference(set(sub.object_id))

{104853812}

缺少最后一个object，因为线上程序运行到最后报错，没有处理，因此暂时复制了倒数第二个object的值，提交试试

In [8]:
pred = pd.read_csv('../result/online_1101_p.csv')

In [9]:
pred.object_id.nunique()

3492890

In [10]:
sub = pd.read_csv('../input/sample_submission.csv')

In [11]:
set(pred.object_id).symmetric_difference(set(sub.object_id))

set()

In [12]:
pred[pred.object_id==104853812]

,class_6,class_15,class_16,class_42,class_52,class_53,class_62,class_64,class_65,class_67,class_88,class_90,class_92,class_95,object_id,class_99
3492890,0.0,0.010489,0.0,0.176699,0.139613,0.0,0.167149,0.000083,0.0,0.181025,0.000018,0.324785,0.0,0.000138,104853812,0.194904

In [13]:
sub[sub.object_id==104853812]

,object_id,class_6,class_15,class_16,class_42,class_52,class_53,class_62,class_64,class_65,class_67,class_88,class_90,class_92,class_95,class_99
2800897,104853812,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0

In [24]:
df = pred.copy()
df[df.object_id.isin(df.object_id[df.object_id.duplicated()])]

,class_6,class_15,class_16,class_42,class_52,class_53,class_62,class_64,class_65,class_67,class_88,class_90,class_92,class_95,object_id,class_99
698995,0.0,0.138613,0.0,0.250844,0.412668,0.0,0.112150,0.000240,0.0,0.006877,0.000018,0.078585,0.0,0.000004,1171843,0.185872
734026,0.0,0.219945,0.0,0.486365,0.107465,0.0,0.143941,0.000298,0.0,0.002338,0.000579,0.038944,0.0,0.000125,1171843,0.178146

In [25]:
df = df.groupby('object_id').mean()

In [27]:
df = df.astype(np.float32)
df['object_id'] = df.index
df['object_id'] = df['object_id'].astype(np.int32)
df = df.drop_duplicates(subset=['object_id'], keep='first')
df.info()
df.object_id.nunique()
# df.to_csv('single_predictions_v3.gz', index=False, float_format='%.6f', compression='gzip')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3492890 entries, 13 to 130788054
Data columns (total 16 columns):
class_6      float32
class_15     float32
class_16     float32
class_42     float32
class_52     float32
class_53     float32
class_62     float32
class_64     float32
class_65     float32
class_67     float32
class_88     float32
class_90     float32
class_92     float32
class_95     float32
class_99     float32
object_id    int32
dtypes: float32(15), int32(1)
memory usage: 239.8 MB

3492890

In [28]:
df.to_csv('single_predictions_v3.gz', index=False, float_format='%.6f', compression='gzip')